app/controllers/meal_plans_controller.rb

  def index
    @current_meal_plan = current_user.meal_plans.where("start_date <= ? AND end_date >= ?", Date.today, Date.today).first
---
SELECT  "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."user_id" = $1 AND (start_date <= '2018-11-25' AND end_date >= '2018-11-25') ORDER BY "meal_plans"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]