app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 ORDER BY "recipes"."id" ASC  [["user_id", 7]]
---
  def index
    @recipes = current_user.recipes.order(:id)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 5], ["LIMIT", 1]]
---
  def show
    @recipe = current_user.recipes.find(params[:id])

INSERT INTO "recipes" ("name", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "test"], ["description", "test description"], ["user_id", 7], ["created_at", "2018-11-19 06:52:11.610797"], ["updated_at", "2018-11-19 06:52:11.610797"]]
---
  def create
    @recipe = current_user.recipes.build(recipe_params)
    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 5], ["LIMIT", 1]]
---
  def edit
    @recipe = current_user.recipes.find(params[:id])

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 5], ["LIMIT", 1]]
UPDATE "recipes" SET "name" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["name", "Xoxoooo shabby chic offal polaroid gentrify truffaut goth."], ["updated_at", "2018-11-19 06:51:44.726364"], ["id", 5]]
---
  def update
    @recipe = current_user.recipes.find(params[:id])
    if @recipe.update_attributes(recipe_params)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1 AND "recipes"."id" = $2 LIMIT $3  [["user_id", 7], ["id", 5], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 5]]
---
  def destroy
    recipe = current_user.recipes.find(params[:id])
    recipe.destroy